Repository: applingua/WelshAppTMX
Catalog: Welsh App TMX by Applingua Ltd.tmx
Source language: en
Languages: cy

source: Paused
cy: Wedi rhewi

source: Unfollowed %{USERNAME}
cy: Wedi stopio dilyn %{USERNAME}

source: Goal turned off
cy: Wedi troi'r nod i ffwrdd

source: BUGS FIXED
cy: WEDI TRWSIO CHWILOD

source: Added
cy: Wedi ychwanegu

source: Replied to a comment
cy: Wedi ymateb i sylw

source: Joined [APPNAME]
cy: Wedi ymuno â [APPNAME]

source: Joined [APPNAME] as %1$@, show them love!
cy: Wedi ymuno â [APPNAME] fel %1$@, dywedwch helo wrthynt!

source: Has joined [APPNAME]!
cy: Wedi ymuno â [APPNAME]!

source: Saved to Movies as:
cy: Wedi'i gadw yn Ffilmiau fel:

source: Seen
cy: Wedi'i weld

source: made by a newer Shifty
cy: wedi'i wneud gan Shifty mwy diweddar

source: Made with
cy: Wedi'i wneud gyda

source: Carved from wood, these helmets will protect you from a single crash each. They won't help with chasms though!
cy: Wedi'u cerfio o bren, bydd yr helmedau hyn yn dy amddiffyn rhag un damwain fesul rhediad. Er hyn, ni fyddant yn dy helpu gyda hafnau!

source: Then
cy: Wedyn

source: English
cy: Welsh

source: Ooops
cy: Wps

source: Whoops - you need an internet connection for that! Please check your device settings.
cy: Wps - rydych angen cysylltiad â'r rhyngrwyd i wneud hynny! Gwiriwch osodiadau eich dyfais.

source: Oops, something went wrong
cy: Wps, aeth rhywbeth o'i le

source: Oops, there's a problem with your chat with %s
cy: Wps, mae problem gyda'ch sgwrs gyda %s

source: Oops, please enter your phone number
cy: Wps, nodwch eich rhif ffôn

source: Oops, sending failed
cy: Wps, wedi methu anfon

source: Oops!
cy: Wps!

source: Whoops!
cy: Wps!

source: Oops! E-Mail not setup
cy: Wps! Heb osod e-bost

source: Oops! There’s a bad internet connection right now, find some net to keep being inspired
cy: Wps! Mae cysylltiad rhyngrwyd gwael iawn ar hyn o bryd, dewch o hyd i gysylltiad da er mwyn parhau i gael eich ysbrydoli

source: Ooops! We can't automatically save your photos without access to your photo library. Please re-enable this permision from you phone's settings located in Settings->Privacy->Photos->Frontback
cy: Wps! Nid ydym yn gallu cadw'ch lluniau yn awtomatig heb fynediad at eich llyfrgell luniau. Ail-alluogwch y caniatâd yma yng ngosodiadau'ch ffôn yn Gosodiadau->Preifatrwydd->Lluniau->Frontback

source: Whoops! Posting failed
cy: Wps! Wedi methu postio

source: Whoops! Sending failed.
cy: Wps. Wedi methu anfon.

source: Of course
cy: Wrth gwrs

source: Of course many other countries will be available soon!
cy: Wrth gwrs bydd nifer o wledydd eraill ar gael cyn bo hir!

source: On start jump to overview
cy: Wrth gychwyn neidio i'r trosolwg

source: On app start
cy: Wrth gychwyn yr ap

source: Restoring Previous Purchases
cy: Wrthi'n adfer eitemau brynoch chi eisoes

source: Restoring…
cy: Wrthi'n adfer…

source: Refreshing…
cy: Wrthi'n adnewyddu…

source: Re-Authorizing Facebook..
cy: Wrthi'n ail-ddilysu Facebook..

source: Logging Out…
cy: Wrthi'n allgofnodi…

source: Sending
cy: Wrthi'n Anfon

source: Sending confirmation code…
cy: Wrthi'n anfon y cod cadarnhau…

source: Sending…
cy: Wrthi'n anfon…

source: Currently Printing
cy: Wrthi'n Argraffu

source: Buffering…
cy: Wrthi'n byffro…

source: Saving
cy: Wrthi'n cadw

source: Accessing AppStore…
cy: Wrthi'n cael mynediad at yr AppStore…

source: Getting location
cy: Wrthi'n cael y lleoliad

source: Canceling…
cy: Wrthi'n Canslo…

source: Cancelling download
cy: Wrthi'n canslo'r lawrlwythiad

source: Canceling subscription…
cy: Wrthi'n canslo'r tanysgrifiad…

source: Collecting System Logs…
cy: Wrthi'n Casglu Dyddlyfrau'r System…

source: Gathering information…
cy: Wrthi'n casglu gwybodaeth…

source: Searching…
cy: Wrthi'n Chwilio…

source: Signing up
cy: Wrthi'n cofrestru

source: Generating backup…
cy: Wrthi'n creu copi wrth gefn…

source: Creating…
cy: Wrthi'n creu…

source: Generating…
cy: Wrthi'n creu…

source: Creating Chat Tile
cy: Wrthi'n Creu'r Teilsen Sgwrsio

source: Submitting..
cy: Wrthi'n cyflwyno..

source: Calculating…
cy: Wrthi'n cyfrifo…

source: Calculating travel time to %@
cy: Wrthi'n cyfrifo'r amser teithio i %@

source: Approving…
cy: Wrthi'n Cymeradwyo…

source: Connecting to Facebook
cy: Wrthi'n cysylltu â Facebook

source: Connecting to iCloud…
cy: Wrthi'n cysylltu ag iCloud…

source: Accepting…
cy: Wrthi'n Derbyn…

source: Picking
cy: Wrthi'n dewis

source: Deleting
cy: Wrthi'n dileu

source: Verifying
cy: Wrthi'n dilysu

source: Replacing with the data in iCloud…
cy: Wrthi'n disodli gyda'r data yn iCloud…

source: Updating
cy: Wrthi'n diweddaru

source: Updating entries
cy: Wrthi'n diweddaru cofnodion

source: Updating time entries
cy: Wrthi'n diweddaru cofnodion amser

source: Updating profile…
cy: Wrthi'n diweddaru'ch proffil…

source: Finding your location%@
cy: Wrthi'n dod o hyd i'ch lleoliad%@

source: Locating…
cy: Wrthi'n eich lleol…

source: Requesting…
cy: Wrthi'n gofyn…

source: Finishing Up…
cy: Wrthi'n gorffen…

source: In progress
cy: Wrthi'n gweithio

source: working…
cy: wrthi'n gweithio…

source: Checking for existing data in iCloud…
cy: Wrthi'n gwirio am ddata presennol yn iCloud…

source: Checking Availability…
cy: Wrthi'n gwirio argaeledd…

source: Checking contacts…
cy: Wrthi'n gwirio cysylltiadau…

source: Declining…
cy: Wrthi'n gwrthod…

source: Fetching info..
cy: Wrthi'n hôl gwybodaeth am..

source: Downloading %@
cy: Wrthi'n lawrlwytho %@

source: Downloading course data
cy: Wrthi'n lawrlwytho data'r cwrs

source: Loading Past Requests…
cy: Wrthi'n llwytho ceisiadau blaenorol…

source: Loading in app purchases …
cy: Wrthi'n llwytho eitemau a brynwyd yn yr ap…

source: Loading …
cy: Wrthi'n llwytho…

source: Loading video…
cy: Wrthi'n llwytho'r fideo…

source: Homescreen loading…
cy: Wrthi'n llwytho'r hafan…

source: Loading profile…
cy: Wrthi'n llwytho'r proffil…

source: Loading reviewing session…
cy: Wrthi'n llwytho'r sesiwn adolygu…

source: Loading learning session…
cy: Wrthi'n llwytho'r sesiwn dysgu…

source: Mapping address, please wait
cy: Wrthi'n mapio'r cyfeiriad, arhoswch

source: Importing
cy: Wrthi'n mewngludo

source: Signing in
cy: Wrthi'n mewngofnodi

source: Logging In…
cy: Wrthi'n mewngofnodi…

source: Preparing %d entries for import
cy: Wrthi'n paratoi %d cofnod ar gyfer mewngludo

source: Preparing migration
cy: Wrthi'n paratoi i fudo

source: Posting (%{PERCENTAGE}%)
cy: Wrthi'n postio (%{PERCENTAGE}%)

source: Posting..
cy: Wrthi'n postio..

source: Processing..
cy: Wrthi'n prosesu..

source: Buying…
cy: Wrthi'n Prynu…

source: Recording…
cy: Wrthi'n recordio…

source: Calling It…
cy: Wrthi'n rhagfynegi…

source: Sharing
cy: Wrthi'n rhannu

source: Now scanning…
cy: Wrthi'n sganio…

source: Moving to iCloud…
cy: Wrthi'n symud i iCloud…

source: Upgrading account…
cy: Wrthi'n uwchraddio'r cyfrif…

source: Adding product to your shopping cart…
cy: Wrthi'n ychwanegu cynnyrch at eich cert siopa…

source: Are you ready for this challenge?
cy: Wyt ti'n barod ar gyfer yr her?

source: Do you like the game?
cy: Wyt ti'n hoffi'r gêm?

source: Are you sure you want to replay the tutorial?
cy: Wyt ti'n siŵr dy fod am ailchwarae'r tiwtorial?

source: Are you sure you want to purchase {0} for {1} coins?
cy: Wyt ti'n siŵr dy fod am brynu {0} am {1} darn arian?

source: Are you sure you want to upgrade {0} to level {1} for {2} coins?
cy: Wyt ti'n siŵr dy fod am uwchraddio {0} i lefel {1} am {2} darn arian?

source: week
cy: wythnos

source: Week %@
cy: Wythnos %@

source: last week
cy: wythnos diwethaf

source: Current week %@, %@
cy: Wythnos gyfredol %@, %@

source: this week
cy: wythnos hon

source: Week to day
cy: Wythnos i ddydd

source: Next Week
cy: Wythnos nesaf

source: current week or month
cy: wythnos neu fis cyfredol

source: Weeks ascending, days ascending
cy: Wythnos o'r dechrau i'r diwedd, diwrnod o'r dechrau i'r diwedd

source: Weeks ascending, days descending
cy: Wythnos o'r dechrau i'r diwedd, diwrnod o'r diwedd i'r dechrau

source: Weeks descending, days ascending
cy: Wythnos o'r diwedd i'r dechrau, diwrnod o'r dechrau i'r diwedd

source: Weeks descending, days descending
cy: Wythnos o'r diwedd i'r dechrau, diwrnod o'r diwedd i'r dechrau

source: Week starts on
cy: Wythnos yn cychwyn ar

source: Week starting:
cy: Wythnos yn cychwyn:

source: weeks
cy: wythnosau

source: weekly
cy: wythnosol

source: Added table
cy: Y bwrdd a ychwanegwyd

source: All
cy: Y cyfan

source: The Plan
cy: Y Cynllun

source: Both
cy: Y ddau

source: United Kingdom
cy: Y Deyrnas Unedig

source: Latest in %s
cy: Y diweddaraf yn %s

source: Best music videos now on TV
cy: Y fideos cerddoriaeth gorau nawr ar y teledu

source: Today's best
cy: Y gorau heddiw

source: Only Starred
cy: Y rhai â seren yn unig

source: Band of Misfits
cy: Y Rhai Anaddas

source: The Team
cy: Y tîm

source: Last Time
cy: Y tro diwethaf

source: Off Lane
cy: Y tu allan i'r lôn

source: Out of Season
cy: Y tu allan i'r tymor

source: all_time_
cy: y_cyfan_

source: OX
cy: YCH

source: Add-ons
cy: Ychwanegion

source: Extra
cy: Ychwanegol

source: Add
cy: Ychwanegu

source: Add %@ to a List?
cy: Ychwanegu %@ at Restr?

source: Add to Passbook™
cy: Ychwanegu at Passbook™

source: Add to Photo Library
cy: Ychwanegu at y llyfrgell lluniau

source: Add Block
cy: Ychwanegu Bloc

source: Add Shift Blocks
cy: Ychwanegu blociau o sifftiau

source: Add table
cy: Ychwanegu bwrdd

source: Add an optional caption
cy: Ychwanegu capsiwn dewisol

source: Add course
cy: Ychwanegu cwrs

source: Address addition
cy: Ychwanegu cyfeiriad

source: add task content…
cy: ychwanegu cynnwys y dasg…

source: Add Contact to Address Book
cy: Ychwanegu cyswllt at y llyfr cyfeiriadau

source: Add new event
cy: Ychwanegu digwyddiad newydd

source: Add emails
cy: Ychwanegu ebyst

source: Add manually
cy: Ychwanegu eich hun

source: Add Your First Shift
cy: Ychwanegu eich sifft gyntaf

source: Add an icon
cy: Ychwanegu eicon

source: Add friend
cy: Ychwanegu ffrind

source: Add Friends
cy: Ychwanegu ffrindiau

source: Add friends from %{PROVIDER} by connecting your account:
cy: Ychwanegu ffrindiau o %{PROVIDER} drwy gysylltu eich cyfrif:

source: Add my first table
cy: Ychwanegu fy mwrdd cyntaf

source: Add my first guest
cy: Ychwanegu fy ngwestai cyntaf

source: Add Employee
cy: Ychwanegu Gweithiwr

source: ADD ACTION
cy: YCHWANEGU GWEITHRED

source: Add Employees
cy: Ychwanegu Gweithwyr

source: Add guest
cy: Ychwanegu gwestai

source: Add new layer
cy: Ychwanegu haen newydd

source: Add Location
cy: Ychwanegu Lleoliad

source: Add Locations
cy: Ychwanegu Lleoliadau

source: Add photo
cy: Ychwanegu llun

source: ADD MORE
cy: YCHWANEGU MWY

source: Add notes here…
cy: Ychwanegu nodiadau yma…

source: Add a note…
cy: Ychwanegu nodyn…

source: Add point
cy: Ychwanegu pwynt

source: Add Sites
cy: Ychwanegu safleoedd

source: Add sample to Designs
cy: Ychwanegu sampl i'r dyluniadau

source: Add Position
cy: Ychwanegu Swydd

source: Add Positions
cy: Ychwanegu Swyddi

source: Add subscriber
cy: Ychwanegu tanysgrifiwr

source: Add A Task
cy: Ychwanegu tasg

source: Add Task
cy: Ychwanegu tasg

source: Add New
cy: Ychwanegu un newydd

source: Add New Unit
cy: Ychwanegu uned newydd

source: Add All
cy: Ychwanegu'r Cwbl

source: Add that personal touch
cy: Ychwanegu'r cyffyrddiad personol

source: Add your Employees to start scheduling.
cy: Ychwanegwch eich gweithwyr i ddechrau amserlennu.

source: Quickly add your staff here. If you know their email or mobile number, we’ll invite them to set up a profile so they can access the schedule online or from their phone.
cy: Ychwanegwch eich staff yn gyflym yma. Os ydych chi'n gwybod eu e-bost neu rif ffôn, byddwn yn eu gwahodd i greu proffil er mwyn iddynt allu cael mynediad at yr amserlen ar-lein neu o'u ffôn.

source: Add the details of the person with whom you want to pretend that you're chatting with.
cy: Ychwanegwch fanylion y person gyda phwy rydych am esgus eich bod yn sgwrsio gyda.

source: Add me on [APPNAME]!
cy: Ychwanegwch fi ar [APPNAME]!

source: Please add a social media account to your device in order to share.
cy: Ychwanegwch gyfrif cyfryngau cymdeithasol i'ch dyfais er mwyn rhannu.

source: Add a comment…
cy: Ychwanegwch sylw…

source: Added %@ to Community Pack
cy: Ychwanegwyd %@ i Becyn Cymunedol

source: Course added
cy: Ychwanegwyd cwrs

source: Post added to World
cy: Ychwanegwyd y Post i'r Byd

source: Recently Added
cy: Ychwanegwyd yn ddiweddar

source: Recently Added %s
cy: Ychwanegwyd yn ddiweddar %s

source: Can I edit events on two devices simultaneously?
cy: Ydw i'n gallu golygu digwyddiadau ar ddwy ddyfais ar yr un pryd?

source: Find this app useful?
cy: Ydy'r ap hwn yn ddefnyddiol?

source: Do you want to disconnect your Twitter account?
cy: Ydych chi am ddatgysylltu'ch cyfrif Twitter?

source: Do you want to DELETE the data on this device and REPLACE it with the data in iCloud?
cy: Ydych chi am DDILEU'R data ar y ddyfais hon a'i DDISODLI gyda'r yn iCloud?

source: Do you want to remove this table?
cy: Ydych chi am gael gwared â'r bwrdd hwn?

source: Do you want to disconnect your Facebook account?
cy: Ydych chi datgysylltu'ch cyfrif Facebook?

source: Do you want to quit the game ?
cy: Ydych chi eisiau rhoi'r gorau i'r gêm?

source: Are you sure?
cy: Ydych chi siŵr?

source: Are you sure? This cannot be undone.
cy: Ydych chi siŵr? Ni ellir dadwneud y weithred hon.

source: Do you really want to unfollow %s?
cy: Ydych chi wir am stopio dilyn %s?

source: Do you really wish to reset?
cy: Ydych chi wir eisiau ailosod?

source: Do you really want to block [USERNAME]?
cy: Ydych chi wir eisiau blocio [USERNAME]?

source: Do you really want to unblock %@?
cy: Ydych chi wir eisiau dadrwystro %@?

source: Do you really want to unblock %1$s?
cy: Ydych chi wir eisiau dadrwystro %1$s?

source: Do you really want to delete your account?
cy: Ydych chi wir eisiau dileu eich cyfrif?

source: Are you ready to clock out?
cy: Ydych chi'n barod i glocio allan?

source: Are you ready to clock in as a %@ at %@?
cy: Ydych chi'n barod i glocio i mewn fel %@ yn %@?

source: Are you ready to clock in as a %@?
cy: Ydych chi'n barod i glocio i mewn fel %@?

source: Are you ready to clock in at %@?
cy: Ydych chi'n barod i glocio i mewn yn %@?

source: Are you ready to clock in?
cy: Ydych chi'n barod i glocio i mewn?

source: Do you love [APPNAME]?
cy: Ydych chi'n hoffi [APPNAME]?

source: Are you sure you want to leave this chat?
cy: Ydych chi'n siŵr eich bod am adael y sgwrs hon?

source: Are you sure you want to quit?
cy: ydych chi'n siŵr eich bod am adael?

source: Are you sure you want to log out?
cy: Ydych chi'n siŵr eich bod am allgofnodi?

source: Are you sure you want to disconnect?
cy: Ydych chi'n siŵr eich bod am ddatgysylltu?

source: Are you sure you want to delete %@?
cy: Ydych chi'n siŵr eich bod am ddileu %@?

source: Are you sure you wish to delete your profile picture?
cy: Ydych chi'n siŵr eich bod am ddileu eich llun proffil?

source: Are you sure you want to erase all your alarms?
cy: Ydych chi'n siŵr eich bod am ddileu pob un o'ch larymau?

source: Are you sure you want to delete your account?
cy: Ydych chi'n siŵr eich bod am ddileu'ch cyfrif?

source: Are you sure you want to delete this course?
cy: Ydych chi'n siŵr eich bod am ddileu'r cwrs hwn?

source: Are you sure you wish to delete this course?
cy: Ydych chi'n siŵr eich bod am ddileu'r cwrs hwn?

source: Are you sure you wish to delete this event? This will happen immediately.
cy: Ydych chi'n siŵr eich bod am ddileu'r digwyddiad hwn? Bydd hyn yn digwydd ar unwaith.

source: Are you sure you want to delete this video?
cy: Ydych chi'n siŵr eich bod am ddileu'r fideo hwn?

source: Are you sure you wish to delete ALL recorded tasks and events?
cy: Ydych chi'n siŵr eich bod am ddileu'r HOLL dasgau a digwyddiadau a gofnodwyd?

source: Are you sure you wish to delete ALL recorded events?
cy: Ydych chi'n siŵr eich bod am ddileu'r HOLL ddigwyddiadau a gofnodwyd?

source: Are you sure you want to delete this message?
cy: Ydych chi'n siŵr eich bod am ddileu'r neges hon?

source: Are you sure, you want to delete selected tasks ? This action can not be undone.
cy: Ydych chi'n siŵr eich bod am ddileu'r tasgau a ddetholwyd? Ni ellir dadwneud y weithred hon.

source: Are you sure you want to unfriend %s?
cy: Ydych chi'n siŵr eich bod am gael gwared â %s fel ffrind?

source: Are you sure you want to unfriend
cy: Ydych chi'n siŵr eich bod am gael gwared â'r ffrind yma

source: Are you sure you want to abort this message?
cy: Ydych chi'n siŵr eich bod am gael gwared â'r neges hon?

source: Are you sure you want to clear the entire Wishlist?
cy: Ydych chi'n siŵr eich bod am glirio'r holl restr dymuniadau?

source: Are you sure you want to unfollow
cy: Ydych chi'n siŵr eich bod am stopio dilyn

source: Remove selected friends?
cy: Ydych chi'n siŵr eich bod eisiau cael gwared â'r ffrindiau a ddewiswyd?

source: Delete message?
cy: Ydych chi'n siŵr eich bod eisiau dileu'r neges hon?

source: Delete selected messages?
cy: Ydych chi'n siŵr eich bod eisiau dileu'r negeseuon a ddewiswyd?

source: Are you sure you want to exit this session? Your progress will be saved
cy: Ydych chi'n siŵr eich bod eisiau gadael y sesiwn yma? Bydd eich cynnydd yn cael ei gadw

source: Are you sure that the number is '%@'
cy: Ydych chi'n siŵr mai '%@' yw'r rhif

source: Are you sure you are going to block this user?
cy: Ydych chi'n siŵr ydych yn mynd i flocio'r defnyddiwr hwn?

source: Drink %@ oz of Water
cy: Yfed %@ owns o ddŵr

source: Drink %@L of Water
cy: Yfed %@L o ddŵr

source: Drink Water
cy: Yfed dŵr

source: Tomorrow
cy: Yfory

source: exercise
cy: ymarfer

source: Work Out %@ Minute
cy: Ymarfer Corff %@ Munud

source: Work Out %@ Minutes
cy: Ymarfer Corff %@ Munud

source: Reply to
cy: Ymateb i

source: Reply to %{USERNAME}
cy: Ymateb i %{USERNAME}

source: Reply to deleted message
cy: Ymateb i neges wedi'i ddileu

source: Reply to this message
cy: Ymateb i'r neges hon

source: Research
cy: Ymchwil

source: My device seems to have gotten 'stuck', how can I fix it?
cy: Ymddengys bod fy nyfais 'wedi rhewi', sut gallaf ei drwsio?

source: It appears you have left a field blank.
cy: Ymddengys eich bod wedi gadael maes yn wag.

source: It appears you have entered an incorrect email.
cy: Ymddengys eich bod wedi nodi cyfeiriad e-bost anghywir.

source: Email address does not appear to be valid
cy: Ymddengys nad yw'r cyfeiriad e-bost yn ddilys

source: It seems this device does not support messaging. :(
cy: Ymddengys nad yw'r ddyfais hon yn cefnogi negeseuon. :(

source: On
cy: Ymlaen

source: UP NEXT
cy: YMLAEN NESAF

source: Hmm.. We weren’t able to find this email.
cy: Ymm.. Nid oeddem yn gallu dod o hyd i'r e-bost hwn.

source: Engage
cy: Ymrwymo

source: Join now
cy: Ymuno nawr

source: Your facebook %@ friend joined [APPNAME]!
cy: Ymunodd eich ffrind facebook %@ â [APPNAME]!

source: A facebook friend joined [APPNAME]!
cy: Ymunodd ffrind Facebook â [APPNAME]!

source: Facebook friend joined [APPNAME]!
cy: Ymunodd ffrind Facebook â [APPNAME]!

source: Join [APPNAME]
cy: Ymunwch â [APPNAME]

source: Join me on [APPNAME]! My username is [USERNAME].
cy: Ymunwch â mi ar [APPNAME]! Fy enw defnyddiwr yw [USERNAME].

source: Join the fun!
cy: Ymunwch â'r hwyl!

source: Disclaimer
cy: Ymwadiad

source: You've visited Brazil!
cy: Ymweloch chi â Brasil!

source: You've visited Canada!
cy: Ymweloch chi â Chanada!

source: You've visited France!
cy: Ymweloch chi â Ffrainc!

source: You've visited Norway!
cy: Ymweloch chi â Norwy!

source: You've visited Russia!
cy: Ymweloch chi â Rwsia!

source: You've visited Spain!
cy: Ymweloch chi â Sbaen!

source: You've visited the United Kingdom of Great Britain!
cy: Ymweloch chi â Theyrnas Unedig Prydain Fawr!

source: You've visited China!
cy: Ymweloch chi â Tsieina!

source: You've visited Germany!
cy: Ymweloch chi â'r Almaen!

source: You've visited Italy!
cy: Ymweloch chi â'r Eidal!

source: You've visited United Arab Emirates!
cy: Ymweloch chi â'r Emiraethau Arabaidd Unedig!

source: You've visited Australia!
cy: Ymweloch chi ag Awstralia!

source: You've visited the United States of America!
cy: Ymweloch chi ag Unol Daleithiau America!

source: in %{CITY}
cy: yn %{CITY}

source: at %{VENUE}
cy: yn %{VENUE}

source: at %@
cy: yn %@

source: Unfortunately something has gone wrong. Try again?
cy: Yn anffodus aeth rhywbeth o'i le. Trio eto?

source: Unfortunately this product could not be loaded.
cy: Yn anffodus nod oedd modd llwytho'r cynnyrch hwn.

source: Unfortunately, we’re only able to offer support in English at this time.
cy: Yn anffodus, dim ond yn Saesneg gallwn gynnig cymorth ar hyn o bryd.

source: Unfortunately, this product is sold out.
cy: Yn anffodus, mae'r cynnyrch hwn wedi gwerthu allan.

source: Unfortunately, this action could not be performed. Try again?
cy: Yn anffodus, nid oedd modd gwneud y weithred hon. Trio eto?

source: Unfortunately this photo is not editable. Please save a new photo to the Camera Roll.
cy: Yn anffodus, nid oes modd golygu'r llun hwn. Cadwch lun newydd i'r rhôl camera.

source: Unfortunately, [APPNAME] has been unable to validate your purchase. In order to continue using the app, please tap “Validate” button below.
cy: Yn anffodus, nid yw [APPNAME] wedi gallu dilysu'ch ymgais i brynu. Er mwyn parhau i ddefnyddio'r ap, tapiwch ar y botwm "Dilysu" isod.

source: Unfortunately the Wishlist could not be loaded. Try again?
cy: Yn anffodus, nod oedd modd llwytho'r rhestr dymuniadau. Trio eto?

source: WAITING
cy: YN AROS

source: Awaiting Action From Others
cy: Yn aros i eraill weithredu

source: Automatically
cy: Yn awtomatig

source: Related To "%s"
cy: Yn berthnasol i \\%s\\

source: Apply To All
cy: Yn berthnasol i'r cwbl

source: Now Popular
cy: Yn Boblogaidd Nawr

source: POPULAR NOW
cy: YN BOBLOGAIDD NAWR

source: Start task
cy: Yn cychwyn tasg

source: presents
cy: yn cyflwyno

source: Contains:
cy: Yn cynnwys:

source: Displaying
cy: Yn dangos

source: Displaying year
cy: Yn dangos blwyddyn

source: Shows the duration for each task.
cy: Yn dangos hyd pob tasg.

source: Displaying month
cy: Yn dangos mis

source: Displaying week
cy: Yn dangos wythnos

source: Later
cy: Yn ddiweddarach

source: Following
cy: Yn dilyn

source: %@ FOLLOWING
cy: YN DILYN %@

source: Pending
cy: Yn disgwyl

source: Expires
cy: Yn dod i ben

source: Expires at %@
cy: Yn dod i ben am %@

source: ends in
cy: yn dod i ben ymhen

source: Expires in %i days
cy: Yn dod i ben ymhen %i diwrnod

source: Coming Soon
cy: Yn dod yn fuan

source: Sets this week as the display week.
cy: Yn gosod hon fel yr wythnos i'w ddangos.

source: Sets the new display day.
cy: Yn gosod y diwrnod newydd i'w dangos.

source: applies after
cy: yn gymwys ar ôl

source: First of all check the Settings App on your home screen, and look under iCloud.
cy: Yn gyntaf oll, gwiriwch yr ap Gosodiadau ar eich sgrin hafan, ac edrychwch ar iCloud.

source: Included in this update:
cy: Yn gynwysedig yn y diweddariad hwn:

source: Love %s? Rate us!
cy: Yn hoff o %s? Sgoriwch ni!

source: Enjoying the [APPNAME] app?
cy: Yn mwynhau ap [APPNAME]?

source: Attending
cy: Yn mynychu

source: Plus much more..
cy: Yn ogystal â llawer mwy..

source: Back
cy: Yn ôl

source: BACK TO DASHBOARD
cy: YN ÔL I'R DANGOSFWRDD

source: Back to map
cy: Yn ôl i'r map

source: Back to top?
cy: Yn ôl i'r top?

source: Getting ready to share…
cy: Yn paratoi i rannu…

source: Trying out [APPNAME]?
cy: Yn rhoi cynnig ar [APPNAME]?

source: Stop task
cy: Yn stopio tasg

source: Feels Like
cy: Yn teimlo fel

source: Feels Like %@
cy: Yn teimlo fel %@

source: Visible only to %{USERNAME}
cy: Yn weladwy i %{USERNAME} yn unig

source: Attached
cy: Ynghlwm

source: About
cy: Ynghylch

source: About the app
cy: Ynglŷn â'r ap

source: About [APPNAME]
cy: Ynglŷn ag [APPNAME]
